import imagePost1 from '../../public/images/posts/post-1.jpeg';
import imagePost2 from '../../public/images/posts/post-2.jpeg';
import imagePost3 from '../../public/images/posts/post-3.jpeg';
import imagePost4 from '../../public/images/posts/post-4.jpeg';

const postsData = [
  {
    id: 'e1',
    title: 'Миссия невыполнима...но я справлюсь!',
    subtitle: 'Заблудшие бараны в горах!',
    text: "Привет, друзья! Сегодня я отправился на самое безумное задание - спасение заблудшей семьи белых баранов в горах! Честно говоря, они вели себя как настоящие черные овцы! Но даже самые забавные приключения не могут остановить меня, Аса Вентуру! Я прыгал по камням, свистел в своей несравненной манере и, конечно же, спас семейство. Теперь они благодарят меня своими овечьими 'бе-е-е' и, я должен сказать, я неплохо разбираюсь в овечьем языке! Приключения продолжаются, так что оставайтесь на связи!",
    image: imagePost1,
    top: true,
  },
  {
    id: 'e2',
    title: 'Как я победил в танцевальном баттле с пингвинами!',
    subtitle: 'Танцы с самыми гибкими пингвинами',
    text: "Здравствуйте, любители веселья и нелепых ситуаций! Сегодня я принял участие в самом удивительном танцевальном баттле в своей жизни! Встретился лицом к лицу с самыми талантливыми танцующими пингвинами на этой планете, и они не шутили! Но, конечно, как я мог не ответить им своими уникальными движениями? Я показал им мою знаменитую 'Пингвинью Шейк' и даже разучил их несколько фишек. В конце концов, они признали мою неоспоримую победу и даже пропустили меня на свою тайную вечеринку! Теперь я знаю, как развлекать пингвинов в их собственном стиле! Вот такие удивительные истории происходят со мной каждый день!",
    image: imagePost2,
    top: false,
  },
  {
    id: 'e3',
    title: 'Как я стал звездой ютуба среди животных!',
    subtitle: 'Мои несравненные трюки и шалости!',
    text: 'Привет, друзья! Все больше и больше животных желают стать звездами интернета, и я не исключение! Я запустил свой собственный канал на YouTube, где показываю свои уникальные трюки и шалости! Вы только посмотрите, как я танцую под дождем, играю на саксофоне для гориллы и даже научил ленивца гонять мяч! Моя команда ассистентов, состоящая из пингвина и носатой обезьяны, всегда помогает мне создавать захватывающий контент! Присоединяйтесь к моему каналу и давайте веселиться вместе!',
    image: imagePost3,
    top: false,
  },
  {
    id: 'e4',
    title: 'Тайна исчезающего ореха!',
    subtitle: 'Шерлок Холмс в мире животных',
    text: 'Случай из жизни Ace Ventura! Сегодня утром у меня произошло захватывающее расследование - исчез орех, который я спрятал перед сном! Я превратился в истинного Шерлока Холмса и начал поиски. Подозреваемые были разные: гиббон, белка и даже крокодил! В итоге я обнаружил, что орех был под носом у меня все время, и моя собственная реакция его скрыла! Это была настоящая загадка, но теперь я знаю, что даже в смешных моментах можно научиться умным урокам!',
    top: true,
    image: imagePost1,
  },
  {
    title: 'Медитация по-моему: Наматрасник, соломинка и спокойствие',
    subtitle: 'Как я нашел гармонию с природой',
    text: 'Друзья, давно не виделись! Недавно я отправился в глушь леса, чтобы найти истинное спокойствие и гармонию с природой. Весь день я медитировал, сидя на мягком наматраснике среди зеленых деревьев и вдыхая аромат свежей травы. Моим учителем служила мудрая сова, которая научила меня находить равновесие даже в самых смешных ситуациях. Это был опыт, которым я хотел бы поделиться со всеми вами, друзьями! Ведь гармония - это ключ к настоящему счастью!',
    image: imagePost4,
    top: false,
  },
];

export default postsData;
